afro_league_api/app/controllers/leagues_controller.rb

  def index
    @leagues = League.all
---
SELECT "leagues".* FROM "leagues"

  def create
    @league = League.new(league_params)

    if @league.save
---
INSERT INTO "leagues" ("player", "position", "team", "coach", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @league.update(league_params)
---
UPDATE "leagues" SET "player" = $1, "position" = $2, "team" = $3, "coach" = $4, "updated_at" = $5 WHERE "leagues"."id" = $6  [["player", "Lebron James"], ["position", "Power Forward/Small Forward/"], ["team", "Los Angeles Lakers"], ["coach", "Frank Vogel"], ["updated_at", "2019-10-18 20:48:32.738791"], ["id", 9]]

  def destroy
    @league.destroy
---
DELETE FROM "leagues" WHERE "leagues"."id" = $1  [["id", 102]]

    def set_league
      @league = League.find(params[:id])
---
SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]