afro_league_api/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "tester@test.com"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email: params["email"]).try(:authenticate, params["password"])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def logged_in
    puts "================= LOGGEDIN SESSIONS"
    puts session[:user_id]
    puts "================= LOGGEDIN SESSIONS"
    @current_user = User.find(session)